title: Correlation - Mass Taskkill Usage Associated with Cicada3301 Ransomware
id: 135e717e-2b3a-485f-9976-40e74a2e558c
status: experimental
description: Detects repeated use of the taskkill utility to terminate processes as documented in the 2024 Morphisec Cicada3301 ransomware report.
references:
    - https://blog.morphisec.com/cicada3301-ransomware-threat-analysis
author: 'Micah Babinski, Based on Morphisec report by Michael Gorelik (@smgoreli)'
date: 2024-09-08
tags:
    - attack.impact
    - attack.t1489
correlation:
    type: event_count
    rules:
        - task_terminated_with_taskkill
    group-by:
        - Computer
    timespan: 10m
    condition:
        gte: 5
level: medium
---
title: Single Taskkill Usage Associated with Cicada3301 Ransomware
name: task_terminated_with_taskkill
id: 78689f2e-64e0-4363-942b-d676a7af7f12
status: experimental
description: Detects a single use of the taskkill utility to terminate processes as documented in the 2024 Morphisec Cicada3301 ransomware report.
author: 'Micah Babinski, Based on Morphisec report by Michael Gorelik (@smgoreli)'
date: 2024-09-08
tags:
    - attack.impact
    - attack.t1489
logsource:
    category: process_creation
    product: windows
detection:
    selection_proc:
        - Image|endswith: '\taskkill.exe'
        - OriginalFileName: 'taskkill.exe'
    selection_cmd:
        CommandLine|contains:
            - 'agntsvc'
            - 'onenote'
            - 'bedbh'
            - 'tv_x64'
            - 'dbeng50'
            - 'oracle'
            - 'vxmon'
            - 'CVMountd'
            - 'dbsnmp'
            - 'outlook'
            - 'benetns'
            - 'cvd'
            - 'encsvc'
            - 'powerpnt'
            - 'bengien'
            - 'cvfwd'
            - 'excel'
            - 'sqbcoreservic'
            - 'pvlsvr'
            - 'CVODS'
            - 'firefox'
            - 'sql'
            - 'beserver'
            - 'saphostexe'
            - 'infopath'
            - 'steam'
            - 'raw_agent_svc'
            - 'saposcol'
            - 'isqlplussvc'
            - 'synctime'
            - 'vsnapvss'
            - 'sapstartsrv'
            - 'msaccess'
            - 'tbirdconfig'
            - 'CagService'
            - 'avagent'
            - 'mspub'
            - 'thebat'
            - 'QBIDPService'
            - 'avscc'
            - 'mydesktopq'
            - 'thunderbird'
            - 'QBDBMgrN'
            - 'DellSystem'
            - 'mydesktopservic'
            - 'visio'
            - 'QBCFMonitorSe'
            - 'EnterpriseClient'
            - 'notepad'
            - 'winword'
            - 'SAP'
            - 'VeeamNFSSvc'
            - 'ocautoupds'
            - 'wordpad'
            - 'TeamViewer_Service'
            - 'VeeamTransportSvc'
            - 'oco'
            - 'xfssvccon'
            - 'TeamViewer'
            - 'VeeamDeploymentSvc'
            - 'ocssd'
            - 'sql'
            - 'tv_w32'
    condition: all of selection_*
falsepositives:
    - Unknown
level: informational