title: Cicada Ransomware PSExec File Creation
id: 76cdd984-4b2b-465d-908f-d55ead0cdc9e
status: experimental
description: Detects creation of a lightly-renamed PSExec file in C:\Users\Public, as observed in the Cicada3301 Ransomware report from MorphiSec.
references:
    - https://blog.morphisec.com/cicada3301-ransomware-threat-analysis
author: 'Micah Babinski, Based on Morphisec report by Michael Gorelik (@smgoreli)'
date: 2024-09-07
tags:
    - attack.lateral-movement
    - attack.execution
    - attack.t1570
    - attack.t1569
    - attack.t1569.002
    - attack.s0029
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: 'psexec'
        TargetFilename|startswith: 'C:\Users\Public'
    filter:
        TargetFilename|endswith: '\psexec.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium