title: Suspicious Command Line Indicating BlackCat Execution
id: df69c374-327e-4146-acff-4a961bb1b755
status: experimental
description: Detects process execution with the --access-token flag accompanied by a 64-character alphanumeric string in the space-delimited command-line arguments..
references:
    - https://www.microsoft.com/en-us/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/
author: Micah Babinski
date: 2022/12/04
tags:
    - attack.execution
    - attack.t1059
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: '--access-token'
        CommandLine|re: '^.*\s{1}[a-zA-Z0-9]{64}\s{1}.*$'
    condition: selection
falsepositives:
    - Unknown
level: high