title: 'Suspicious Registry Key Set (MaxMpxCt)'
id: 4bd730d9-37d6-4a87-b392-ffb9ab52bf21
status: experimental
description: Detects registry value set to change MaxMpxCt settings. BlackCat does this to increase the number of outstanding requests allowed, such as SMB requests to distribute ransomware through an environment.
references:
    - https://www.microsoft.com/en-us/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/
author: Micah Babinski
date: 2022/12/04
tags:
    - attack.command_and_control
    - attack.defense_evasion
    - attack.t1105
    - attack.t1562
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject: 'HKLM\System\CurrentControlSet\Services\LanmanServer\Parameters\MaxMpxCt'
        Details: 'DWORD (0x0000ffff)'
    condition: selection
falsepositives:
    - Unknown
level: high