title: Suspicious Fsutil Execution Allowing Remote Connections
id: 27e58290-85bf-4bd4-8eab-1c493139b659
status: experimental
description: Detects the use of fsutil to permit additional types of symbolic links on a computer. These can be used to enable ransomware to follow shortcusts to find all files it wants to encrypt.
references:
    - https://www.microsoft.com/en-us/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/
    - https://www.cybereason.com/blog/cybereason-vs.-blackcat-ransomware
author: Micah Babinski
date: 2022/12/05
tags:
    - attack.persistence
    - attack.t1547
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\fsutil.exe'
        CommandLine|contains|all:
            - 'behavior'
            - 'set'
            - 'SymlinkEvaluation'
        CommandLine|re: '^.*(R|L)2(R|L):1.*$'
    condition: selection
falsepositives:
    - Unknown
level: high