title: Mac AppleScript Input Prompt
id: cff40f2b-46e9-49cc-8ba5-dde6403ab453
status: experimental
description: |
    Adversaries leverage AppleScript to try to steal the user’s login password. 
    This analytic attempts to detect that activity via the first variation. 
    Part of the RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/applescript/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.execution
    - attack.t1059
    - attack.t1059.002
logsource:
    product: macos
    category: process_creation
detection:
    selection:
        CommandLine|contains|all:
            - 'osascript'
            - 'display dialog'
            - 'password'
    condition: selection
falsepositives:
    - Unknown
level: low