title: Windows Explorer Spawning Command Shell with Start and Exit Commands
id: ebb4eaad-9909-4785-a038-97bdee8aa5ae
status: experimental
description: |
    This detection analytic looks for instances of explorer.exe spawning cmd.exe along 
    with corresponding start and exit commands that we commonly observe in conjunction 
    with a wide variety of malicious activity. Part of the RedCanary 2024 Threat 
    Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.execution
    - attack.t1059
    - attack.t1059.003
    - attack.t1053
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\explorer.exe'
        Image|endswith: '\cmd.exe'
        CommandLine|contains|all:
            - 'start'
            - 'exit'
    condition: selection
falsepositives:
    - Unknown
level: low