title: Service Control Manager Spawning Command Shell with Suspect Strings
id: cdf9f0ba-857a-4f91-9f30-724ade93b797
status: experimental
description: |
    The following pseudo detector should generate an alert when services.exe spawns 
    cmd.exe along with a corresponding echo or /c command, which are common attributes 
    of post exploitation that we’ve seen in association with this technique. Part of 
    the RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.execution
    - attack.t1059
    - attack.t1059.003
    - attack.t1569
    - attack.t1569.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\services.exe'
        Image|endswith: '\cmd.exe'
        CommandLine|contains:
            - 'echo'
            - '/c'
    condition: selection
falsepositives:
    - Unknown
level: low