title: SecretsDump File Modification
id: 88de04f6-c443-40ec-a592-72c31a55810b
status: experimental
description: |
    Impacket’s SecretsDump utility consistently involves the Windows Service Host 
    (svchost.exe) writing randomly named .tmp files to the System32 directory. The 
    following pseudo-detector should offer defenders a reliable method of detecting 
    Impacket's SecretsDump utility. Part of the RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/os-credential-dumping/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: '\svchost.exe'
        ImageLoaded|endswith: '\regsvc.dll'
        # TargetFilename|contains: 'windows\system32' # need to join file creation events on process id
    condition: selection
falsepositives:
    - Unknown
level: low