title: Systemd Loading a Linux Kernel Module Using modprobe
id: 4d786f58-8222-4047-b635-6432da31bd7c
status: experimental
description: |
    Detects the systemd process loading a Linux Kernel Modules using modprobe. Part of the 
    RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/kernel-modules-and-extensions/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1547
    - attack.t1547.006
logsource:
    product: linux
    category: process_creation
detection:
    selection1:
        ParentImage|endswith: '/systemd'
        Image|endswith: '/modprobe'
        CommandLine|contains:
            - '-a'
            - '-af'
            - '-fa'
    selection2:
        CommandLine|re: '^.*modprobe.*\s[a-zA-Z].*$' # looks for commands with an argument that does
        # not begin with '-'
    condition: all of selection*
falsepositives:
    - Unknown
level: low