title: Office Products Spawning WMI
id: 0c2d39af-2c24-42c4-9bab-35e30ad2aeb8
status: experimental
description: |
    It’s almost always malicious when wmic.exe spawns as a child process of Microsoft Office and 
    similar products. As such, it makes sense to examine the chain of execution and follow-on 
    activity when this occurs. The following is a non-exhaustive example analytic that will catch 
    some of this activity. Part of the RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-management-instrumentation/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.execution
    - attack.t1047
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - '\winword.exe'
            - '\excel.exe'
        Image|endswith: '\wmic.exe'
    condition: selection
falsepositives:
    - Unknown
level: low