title: Mimikatz Module Names
id: 8628d9d9-3a53-4d2e-b1cf-1d2e606cfd1d
status: experimental
description: |
    Identifies processes in which Mimikatz module names are observed as command-line parameters. 
    Part of the RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/mimikatz/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.credential_access
    - attack.t1003
    - attack.s0002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'sekurlsa::logonpasswords'
            - 'lsadump::sam'
            - 'sekurlsa::tickets'
    condition: selection
falsepositives:
    - Unknown
level: low