title: Secretsdump.py Execution
id: 1337f1b5-8524-40f7-bf08-b0dec46cb764
status: experimental
description: |
    This detection analytic identifies Impacket’s secretsdump.py script on a target host, which is the most common script we have observed 
    in customer environments. secretsdump.py is remotely run on an adversary’s machine to steal credentials. The command is commonly 
    executed by svchost.exe, where regsvc.dll is loaded which allows the export of credentials from the registry. The output is redirected 
    to an eight-character TMP file within the System32 directory. Part of the RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/impacket/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.s0357
    - attack.credential_access
    - attack.t1003
    - attack.t1003.003
    - attack.t1003.006
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: '\svchost.exe'
        TargetFilename|re: '^.*:\\windows\\system32\\\w{8}\.tmp$'
    condition: selection
falsepositives:
    - Unknown
level: low