title: AppInit DLL Installation
id: 65e7b868-ebe9-4e8a-b828-3bd2181bc407
status: experimental
description: |
    One persistence mechanism used by some variations of SmashJacker was an AppInit DLL. 
    It would use a reg.exe command to create appropriate Windows Registry keys for 
    persistence. Part of the RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/smashjacker/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.privilege_escalation
    - attack.persistence
    - attack.t1546
    - attack.t1546.010
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\reg.exe'
        CommandLine|contains|all:
            - 'add'
            - 'AppInit_DLLs'
    condition: selection
falsepositives:
    - Unknown
level: low