title: Gamarue Rundll32.exe Long Commandlines
id: 66fa7a57-1c53-42e1-9e5c-e9a1f5e62784
status: experimental
description: |
    Fortunately for defenders, Gamarue is detectable with endpoint telemetry. The majority 
    of Gamarue activity we see involves rundll32.exe executing with unusual command lines 
    that include long filenames with repeating characters and random function names. Part 
    of the RedCanary 2024 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/gamarue/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2024/03/21
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.t1027.010
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|re: .*\S{10,70}\.\S{10,70},\w{16}
    condition: selection
falsepositives:
    - Unknown
level: low