title: BITSAdmin Downloading Malicious Binaries
id: c7568c9e-f6c6-4cb7-a3c0-da356aef51d8
status: experimental
description: Detects usage of BITSAdmin to download malicious code. Inspired by the
  2022 Red Canary Threat Detection report.
references:
    - https://redcanary.com/threat-detection-report/techniques/ingress-tool-transfer/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1105/T1105.md#atomic-test-9---windows---bitsadmin-bits-download
author: Micah Babinski
date: 2022/11/03
tags:
    - attack.command_and_control
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\bitsadmin.exe'
        CommandLine|contains:
            - 'download'
            - 'transfer'
    condition: selection
falsepositives:
    - Unknown
level: high