title: Command Shell Obfuscated Commands
id: a30afe67-bde7-450f-a143-96a1a86d26d9
status: test
description: Looks for the execution of Windows Command Shell with unusually high
    counts of characters used for obfuscation. Inspired by the 2022 Red Canary Threat
    Detection report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Micah Babinski
date: 2022/11/03
tags:
    - attack.execution
    - attack.t1059.003
    - attack.defense_evasion
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: '\cmd.exe'
        # regex below looks for eight or more total instances of the suspicious characters
        CommandLine|re: '^([^^=%![(; ]*[\^=%![(; ]){8,}[^^=%![(; ]*$'
falsepositives:
    - Legitimate processes with long or convoluted command lines.
level: high