title: Abnormal LSASS Child and Parent Process Relationships
id: 67ba1ddd-4510-42d5-aa78-83bed66bd684
status: test
description: Detects potential lsass.exe abuse based on unusual and suspicious parent-child
    relationships. Inspired by the 2022 Red Canary Threat Detection report.
references:
    - https://redcanary.com/threat-detection-report/techniques/lsass-memory/
author: Micah Babinski
date: 2022/11/03
tags:
    - attack.credential_access
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
            - '\regsvr32.exe'
            - '\mstsc.exe'
            - '\dllhost.exe'
        ParentImage|endswith: \lsass.exe'
    selection2:
        Image|endswith: '\lsass.exe'
        ParentImage|endswith:
            - '\explorer.exe'
            - '\cmd.exe'
            - '\lsass.exe'
    condition: selection1 or selection2
falsepositives:
    - Unknown
level: medium