title: Suspicious WMI-Related Powershell Cmdlets
id: c920d5b8-0e50-40ef-8f1a-5eb27399f455
status: experimental
description: Detects potential adversaries using powershell WMI-related cmdlets to
    query the operating system or execute commands, either locally or remotely. Inspired
    by the 2022 Red Canary Threat Detection report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-management-instrumentation/
author: Micah Babinski
date: 2022/11/03
tags:
    - attack.execution
    - attack.t1059
    - attack.t1059.001
    - attack.t1047
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
        CommandLine|contains:
            - 'invoke-wmimethod'
            - 'invoke-cimmethod'
            - 'get-wmiobject'
            - 'getciminstance'
            - 'wmiclass'
    condition: selection
falsepositives:
    - Unknown
level: medium