title: Suspicious Powershell Cmdlets
id: b3dfac86-1056-4b6b-9c67-db4a10a9e812
status: test
description: Looks for look for cmdlets, methods, and switches that may indicate malicious
    activity. Inspired by the 2022 Red Canary Threat Detection report.
references:
    - https://redcanary.com/threat-detection-report/techniques/powershell/
author: Micah Babinski
date: 2022/11/03
tags:
    - attack.execution
    - attack.t1059
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
        CommandLine|contains|windash:
            - '-nop'
            - '-noni'
            - 'invoke-expression'
            - 'iex'
            - 'downloadstring'
            - 'downloadfile'
            - 'downloadata'
    condition: selection
falsepositives:
    - Unknown
level: high