title: Windows Scheduled Task Making Suspicious Network Connection
id: 4a224230-746d-436b-b569-59f2d6809d6b
status: experimental
description: Detects scheduled tasks created to reach out to external domains and
    download arbitrary binaries on a set or recurring schedule. Inspired by the 2022
    Red Canary Threat Detection report.
references:
    - https://redcanary.com/threat-detection-report/techniques/scheduled-task/
author: Micah Babinski
date: 2022/11/04
tags:
    - attack.persistence
    - attack.execution
    - attack.t1053
    - attack.t1053.005
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\schtasks.exe'
        CommandLine|contains|windash: '/create'
        CommandLine|contains:
            - 'https://'
            - 'http://'
            - 'ftp://'
    condition: selection
falsepositives:
    - Creation of legitimate scheduled tasks which need to access external sites.
level: medium