title: Svchost Not Matching Normal Execution Parameters
id: 036c727d-0263-4733-ad60-d5f48dc72144
status: experimental
description: Looks for the execution of svchost without the normal -k parameter. Inspired
    by the 2022 Red Canary Threat Detection report.
references:
    - https://redcanary.com/threat-detection-report/techniques/match-legitimate-name-or-location/
author: Micah Babinski
date: 2022/11/04
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1036.005
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\svchost.exe'
    filter:
        CommandLine|contains: '-k'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high