title: Possible Impacket Secretsdump.py Activity
id: 8d1476b7-0f57-43a4-b56b-50bfab66943d
status: experimental
description: Detects attempts to retrieve/dump credentials using the DL_DRSGetNCChanges() method.
references:
    - https://www.extrahop.com/company/blog/2021/dcsync-definition-and-protection/
    - https://www.secureauth.com/labs/open-source-tools/impacket/
    - https://wiki.samba.org/index.php/DRSUAPI
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-drsr/9b4bfb44-6656-4404-bcc8-dc88111658b3
author: Micah Babinski
date: 2023/04/13
tags:
    - attack.s0357
    - attack.credential_access
    - attack.t1003
    - attack.t1003.003
    - attack.t1003.006
logsource:
    product: zeek
    service: dce_rpc
detection:
    selection:
        operation: DRSGetNCChanges
        endpoint: drsuapi
        id.resp_p: 49666
        named_pipe: '49666'
    condition: selection
fields:
    - id.orig_h
falsepositives:
    - This may detect legitimate Active Directory domain control replication/sync activity (perhaps filter by inbound/outbound IP addresses of your known DCs)
level: low