title: HTML File Created in Suspicious Location (Sysmon)
id: 04d7040f-755c-4e6d-94db-94fc690a69b5
status: experimental
description: Detects creation of HTML files in locations used in HTML smuggling technique. Commonly associated with QakBot and IcedID.
references:
    - https://www.socinvestigation.com/html-smuggling-phishing-attacks-on-rise-detection-response/
    - https://www.cyfirma.com/outofband/html-smuggling-a-stealthier-approach-to-deliver-malware/
author: Micah Babinski
date: 2022/12/178
tags:
    - attack.s0650
    - attack.s0483
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566.001
    - attack.t1566
    - attack.t1027
    - attack.t1027.006
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - '.html'
            - '.htm'
        TargetFilename|re: '^[A-Z]:\\Users\\.*\\(Downloads\\|Content\.Outlook\\|AppData\\Local\\Temp).*$'
    condition: selection
falsepositives:
    - Plenty, this rule should probably only be used at the start of a chain rule for HTML smuggling or for demonstration purposes.
level: low