title: Malicious QakBot Dropped File Creation (Sysmon)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects creation of files potentially associated with QakBot initial infection, documented by Adithya Chandra and Sushant Kumar Arya of Trellix in August 2022.
references:
    - https://www.trellix.com/en-us/about/newsroom/stories/research/demystifying-qbot-malware.html
author: Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
    - attack.t1027
    - attack.t1553
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - '.html'
            - '.zip'
            - '.iso'
            - '.lnk'
        TargetFilename|re: '.*TXRTN_[0-9]{7}\..*'
    condition: selection
falsepositives:
    - Unknown
level: high