title: Cobalt Strike Beacon Implant Command Issued via Named Pipe (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects named pipe creation indicating Cobalt Strike beacon implant issuing commands via SMB named pipe. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/cobalt-strike/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: pipe_created
    product: windows
detection:
    selection:
        PipeName|startswith:
            - '\msagent_'
            - '\interprocess_'
            - '\lsarpc_'
            - '\samr_'
            - '\netlogon_'
            - '\wkssvc_'
            - '\srvsvc_'
            - '\mojo_'
            - '\postex_'
            - '\status_'
            - '\msse-'
    condition: selection
falsepositives:
    - Unknown
level: low