title: Windows Scripting Host Executing JScript Files with MS-DOS Short Names (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects Windows scripting host executing JavaScript files with MS-DOS shortname formatting, a technique associated with Gootloader. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/gootloader/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\cscript.exe'
        CommandLine|contains: '~1.js'
    condition: selection
falsepositives:
    - Unknown
level: low