title: Impacket Atexec.py Execution (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects execution from Impacket's atexec.py. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/impacket/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - '\svchost.exe'
            - '\taskeng.exe'
        CommandLine|contains|all:
            - 'cmd.exe'
            - 'windows\temp'
            - '2>&1'
    condition: selection
falsepositives:
    - Unknown
level: low