title: Mimikatz Module Names in Command Line (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects presence of common Mimikatz module names in command line strings. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/mimikatz/
    - https://github.com/gentilkiwi/mimikatz/wiki (for additional module names)
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'sekurlsa::logonpasswords'
            - 'lsadump::sam'
            - 'sekurlsa::minidump'
    condition: selection
falsepositives:
    - Unknown
level: low