title: Default Impacket Service Creation Via Registry Keys (RedCanary Threat Detection Report)
id: 187ac7b5-f919-446b-93b3-cde8a6506d64
status: experimental
description: Detects registry key creation matching default Impacket default naming convention. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-admin-shares/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.lateral_movement
    - attack.t1021.002
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        Image|endswith: '\services.exe'
        EventType: 'CreateKey'
        TargetObject: 'HKLM\System\CurrentControlSet\Services\BTOBTO'
    condition: selection
falsepositives:
    - Unknown
level: low