title: File Writes Within Admin Shares (RedCanary Threat Detection Report)
id: 7d5c80c9-c2a0-4eeb-9988-3d1ac170ffc0
status: experimental
description: Detects files written to an Admin Share. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-admin-shares/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.lateral_movement
    - attack.t1021.002
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - '.exe'
            - '.dll'
            - '.bat'
        TargetFilename|contains:
            - 'ADMIN$'
            - 'IPC$'
            - 'C$'
    condition: selection
falsepositives:
    - Depends; may require baselining and exclusions for legitimate use.
level: low