title: WMI Reconnaissance (RedCanary Threat Detection Report)
id: 4f2f005d-8755-4ff8-9086-179fc632a850
status: experimental
description: Detects the wmic reconnaissance activity. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-management-instrumentation/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.execution
    - attack.t1047
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\wmic.exe'
        CommandLine|contains:
            - '\ldap'
            - 'ntdomain'
    condition: selection
falsepositives:
    - Unknown.
level: low