title: ISO File Write to Suspicious Folder (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects files written to user downloads folder or appdata folder, associated with Mark-of-the-Web Bypass. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/mark-of-the-web-bypass/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: file_event
    product: windows
detection:
    selection_iso:
        TargetFilename|endswith: '.iso'
    selection_user_downloads:
        TargetFilename|contains|all:
            - 'Users'
            - 'Downloads'
    selection_appdata:
        TargetFilename|contains: 'appdata'
    condition: selection_iso and (selection_user_downloads or selection_appdata)
falsepositives:
    - Unknown
level: low