title: Default Impacket Service Creation Via Registry Keys (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects registry key creation matching default Impacket default naming convention. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-admin-shares/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        Image|endswith: '\services.exe'
        EventType: 'CreateKey'
        TargetObject: 'HKLM\System\CurrentControlSet\Services\BTOBTO'
    condition: selection
falsepositives:
    - Unknown
level: low