title: Service Control Manager Spawning Command Shell (RedCanary Threat Detection Report)
id: 80f850be-12ea-4bb8-b000-6e485dc821f5
status: experimental
description: |
    Detects suspect command line strings in CMD processes spawned by services.exe. 
    Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.execution
    - attack.t1059.003
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\services.exe'
        Image|endswith: '\cmd.exe'
        CommandLine|contains|windash:
            - 'echo'
            - '/c'
    condition: selection
falsepositives:
    - Unknown
level: low