title: File Writes Within Admin Shares (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects files written to an Admin Share. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-admin-shares/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - '.exe'
            - '.dll'
            - '.bat'
        TargetFilename|contains:
            - 'ADMIN$'
            - 'IPC$'
            - 'C$'
    condition: selection
falsepositives:
    - Depends; may require baselining and exclusions for legitimate use.
level: low