title: WMI Suspicious Process Lineage (RedCanary Threat Detection Report)
id: 03fd0ccb-e246-451d-9923-f0698642a0ec
status: experimental
description: Detects the WMI provider host spawning suspicious processes. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-management-instrumentation/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.execution
    - attack.t1047
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\wmiprvse.exe'
        Image|endswith:
            - '\rundll32.exe'
            - '\msbuild.exe'
            - '\powershell.exe'
            - '\cmd.exe'
            - '\mshta.exe'
    condition: selection
falsepositives:
    - Unknown
level: low