title: QBot rundll32.exe Non-standard File Proxy Execution (RedCanary Threat Detection Report)
id: bb1cfac0-eca2-4803-9acd-aa75f5b84ff4
status: experimental
description: Detects Rundll32.exe process creations with non-standard file types denoted by excluding the common file types from the command-=line selection. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/qbot/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.s0650
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\rundll32.exe'
    filter:
        CommandLine|contains:
            - '.dll'
            - '.cpl'
            - '.ax'
            - '.ocx'
            - '.inf'
    condition: selection and not filter
falsepositives:
    - Unknown
level: low