title: Windows Scripting Host Executing JScript Files with MS-DOS Short Names (RedCanary Threat Detection Report)
id: 1aa0b866-727e-480f-9694-6bd694e2855d
status: experimental
description: Detects Windows scripting host executing JavaScript files with MS-DOS shortname formatting, a technique associated with Gootloader. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/gootloader/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\cscript.exe'
        CommandLine|contains: '~1.js'
    condition: selection
falsepositives:
    - Unknown
level: low