title: AdSearch Reg Runkey Persistence Execution (RedCanary Threat Detection Report)
id: b50624c2-7867-4685-817e-88c72da264c7
status: experimental
description: Detects registry modifications to CurrentVersion\Run key, associated with AdSearch. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/adsearch/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'reg'
            - 'add'
            - 'currentversion\run'
    condition: selection
falsepositives:
    - Rule is likely to require tuning to exclude normal, authorized activity
level: low