title: Potential Gamarue DLL Filename (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects Gamarue DLL filename in command line strings. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/gamarue/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\rundll32.exe'
        CommandLine|re: '\S{10,70}\.\S{10,70},\w{16}'
    condition: selection
falsepositives:
    - Unknown
level: low