title: Potential Gamarue DLL Filename (RedCanary Threat Detection Report)
id: 62989cd5-4d35-4ce8-a1fd-73673c25d0f4
status: experimental
description: Detects Gamarue DLL filename in command line strings. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/gamarue/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.privilege_escalation
    - attack.t1055.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\rundll32.exe'
        CommandLine|re: '\S{10,70}\.\S{10,70},\w{16}'
    condition: selection
falsepositives:
    - Unknown
level: low