title: AdSearch Startup Folder Persistence File Creation (RedCanary Threat Detection Report)
id: 739d97f7-96e3-4e96-aebb-574b4f19d034
status: experimental
description: Detects file creations by cscript in the startup folder, associated with AdSearch. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/adsearch/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: '\cscript.exe'
        TargetFilename|contains: 'start menu\programs\startup'
    condition: selection
falsepositives:
    - Rule is likely to require tuning to exclude normal, authorized activity
level: low