title: Cobalt Strike UAC Bypass Using SQL Server Client Configuration Utility (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects a possible Cobalt Strike UAC bypass attempt using cliconfg.exe, the SQL Server Client Configuration Utility. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/cobalt-strike/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\rundll32.exe'
        Image|endswith: '\cliconfg.exe'
    condition: selection
falsepositives:
    - Unknown
level: low