title: Gootloader JavaScript Execution in AppData Folder (RedCanary Threat Detection Report)
id: 5e284df6-3a2e-4ac1-8907-29fdc6b43757
status: experimental
description: Detects execution of JavaScript (.js) files located in the AppData folder. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/gootloader/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\wscript.exe'
        CommandLine|re: '(?i)appdata\\.*\.js'
    condition: selection
falsepositives:
    - Unknown
level: low