title: PlugX DLL Search Order Hijacking Using Avast wsc_proxy (RedCanary Threat Detection Report)
id: c518ac74-2e2b-4197-84d7-ea5118c557eb
status: experimental
description: |
    Detects possible DLL Search Order hijacking using Avast antivirus wsc_proxy application. 
    This technique is associated with PlugX. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/raspberry-robin/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.s0013
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\wsc_proxy.exe'
    filter:
        Image|contains: '\program files\'
    condition: selection and not filter
falsepositives:
    - Could be the result of an administrator installing the application in a custom path
level: low