title: Mimikatz .kirbi File Creation (RedCanary Threat Detection Report)
id: 3f5c1eae-a9ef-44a2-bd04-a8a0e3762ec3
status: experimental
description: Detects .kirbi files created, commonly associated with Mimikatz. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/mimikatz/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.s0002
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: '.kirbi'
    condition: selection
falsepositives:
    - Unknown
level: low