title: Yellow Cockatoo PowerShell Suspicious .NET Methods (RedCanary Threat Detection Report)
id: e2c6d4c8-2e14-47a8-b22c-e4c9e7e65d0e
status: experimental
description: Detects suspicious Powershell script load contents associated with Yellow Cockatoo, AKA Solarmarker/Jupyter Stealer. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/yellow-cockatoo/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - 'aescryptoserviceprovider'
            - 'frombase64string'
            - 'user32.dll'
    condition: selection
falsepositives:
    - Unknown
level: low