title: Common BloodHound Command-Line Options (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects common BloodHound parameters in command line strings. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/bloodhound/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - '-collectionmethod'
            - 'invoke-bloodhound'
            - 'get-bloodhounddata'
    condition: selection
falsepositives:
    - Unknown
level: low