title: SocGholish NLTest Domain Trust Enumeration (RedCanary Threat Detection Report)
id: cdd824c2-ebda-404e-ad62-b2acf251976a
status: experimental
description: Detects domain trust enumeration with nltest.exe, a procedure associated with SocGholish. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/socgholish/#threat-socgholish
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.discovery
    - attack.t1482
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\nltest.exe'
        CommandLine|contains|windash:
            - '/domain_trusts'
            - '/all_trusts'
    condition: selection
falsepositives:
    - Unknown
level: low