title: AdSearch Startup Folder Persistence File Creation (RedCanary Threat Detection Report)
id: 8e401ffe-ca9b-4bb2-87aa-8e285811d43f
status: experimental
description: Detects file creations by cscript in the startup folder, associated with AdSearch. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/adsearch/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2022/11/17
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: '\cscript.exe'
        TargetFilename|contains: 'start menu\programs\startup'
    condition: selection
falsepositives:
    - Rule is likely to require tuning to exclude normal, authorized activity
level: low