title: Cobalt Strike Beacon Getsystem Pattern (RedCanary Threat Detection Report)
id: 187c05df-debd-40ed-a59e-1163703bb1de
status: experimental
description: Detects command line pattern indicating the use of Cobalt Strike GetSystem feature. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/cobalt-strike/
    - https://www.cobaltstrike.com/blog/what-happens-when-i-type-getsystem/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.s0154
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\cmd.exe'
        CommandLine|re: '^.*echo\s+[0-9a-f]{11}\s+\>\;?\s+\\\\\.\\pipe\\[0-9a-f]{6}.*$'
    condition: selection
falsepositives:
    - Unknown
level: low