title: Impacket SMBexec.py Execution (RedCanary Threat Detection Report)
id: 671651fd-62e1-48d7-b5e0-81b1746ec0dd
status: experimental
description: Detects execution from Impacket's smbexec.py. Part of the RedCanary 2023 Threat Detection Report.
references:
    - https://redcanary.com/threat-detection-report/threats/impacket/
author: RedCanary, Sigma formatting by Micah Babinski
date: 2023/05/10
tags:
    - attack.s0357
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\services.exe'
        Image|endswith: '\cmd.exe'
        CommandLine|re: '/(?i)cmd.exe \/Q \/c echo cd \^> \\\\127.0.0.1\\[a-zA-Z]{1,}\$\\__output 2\^>\^&1 > .* & /'
    condition: selection
falsepositives:
    - Unknown
level: low