title: ISO, VHD, LNK or IMG File Extracted from Zip (Sysmon)
id: f853978d-343e-4879-ab56-dfe07f1f2f0b
status: experimental
description: Detects extraction of ISO, VHD, LNK, or IMG files from zip files. Commonly associated with QakBot and IcedID.
references:
    - https://blog.talosintelligence.com/html-smugglers-turn-to-svg-images/#:~:text=HTML%20smuggling%20is%20a%20technique,directly%20on%20the%20victim's%20device.
    - https://www.malwarebytes.com/blog/news/2021/11/evasive-maneuvers-html-smuggling-explained
author: Micah Babinski
date: 2022/12/15
tags:
    - attack.s0650
    - attack.s0483
    - attack.defense_evasion
    - attack.t1027
    - attack.t1027.006
    - attack.t1564
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith:
            - '\explorer.exe'
            - '\WinRAR.exe'
        TargetFilename|endswith:
            - '.iso'
            - '.vhd'
            - '.img'
            - '.lnk'
    condition: selection
falsepositives:
    - Unknown
level: medium