title: Chrome Spawned by Powershell with Load-Extension in Command Line
id: 4007bc45-1727-405d-a7bc-4b3d441bf08f
status: experimental
description: Detects instances of the Chrome browser executable spawning from PowerShell with a corresponding command line that includes appdata\local as a parameter.
references:
    - https://redcanary.com/blog/chromeloader/
    - https://blogs.vmware.com/security/2022/09/the-evolution-of-the-chromeloader-malware.html
author: Micah Babinski
date: 2022/11/07
tags:
    - attack.persistence
    - attack.t1176
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\powershell.exe'
        Image|endswith: '\chrome.exe'
        CommandLine|contains|all:
            - 'appdata\local'
            - 'load-extension'
    condition: selection
falsepositives:
    - Unknown
level: high