title: HTML File Created in Suspicious Location
id: 04d7040f-755c-4e6d-94db-94fc690a69b5
status: experimental
description: Detects creation of HTML files in locations used in HTML smuggling technique.
references:
    - https://www.socinvestigation.com/html-smuggling-phishing-attacks-on-rise-detection-response/
    - https://www.cyfirma.com/outofband/html-smuggling-a-stealthier-approach-to-deliver-malware/
author: Micah Babinski
date: 2022/12/178
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.t1027.006
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4663
        ObjectType: 'File'
        AccessList: '%%4417'
        ObjectName|endswith:
            - '.html'
            - '.htm'
        ObjectName|re: '^[A-Z]:\\Users\\.*\\(Downloads\\|Content\.Outlook\\|AppData\\Local\\Temp\\Temp\.{1}_|Appdata\\Local\\Temp\\7z|Appdata\\Local\\Temp\\Rar).*$'
    condition: selection
falsepositives:
    - Plenty, this rule should probably only be used at the start of a chain rule for HTML smuggling or for demonstration purposes.
level: low