title: Suspicious Impacket Pipe Creation - Psexec
id: 019a9cea-6b05-4ea3-9aa2-f8ff6f9e92d5
status: experimental
description: Detects named pipes created as a result of Impacket PSExec.py usage. 
references:
    - https://github.com/fortra/impacket/blob/impacket_0_9_24/examples/psexec.py
    - https://www.13cubed.com/downloads/impacket_exec_commands_cheat_sheet.pdf
author: Micah Babinski
date: 2023/01/08
tags:
    - attack.s0357
    - attack.execution
    - attack.t1569
    - attack.t1569.002
logsource:
    category: pipe_created
    product: windows
    definition: 'Note that you have to configure logging for Named Pipe Events in Sysmon config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config, https://github.com/olafhartong/sysmon-modular. How to test detection? You can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575'
detection:
    selection:
        Image|re: '^c:\\Windows\\[A-Za-z]{8}\.exe$'
        PipeName|startswith: '\RemCom_'
    condition: selection
fields:
    - Image
    - PipeName
falsepositives:
    - Unknown
level: high