title: HTML File Created in Suspicious Location
id: dc76d809-fafd-430d-ad74-7184b1155962
status: experimental
description: Detects creation of HTML files in locations used in HTML smuggling technique.
references:
    - https://www.socinvestigation.com/html-smuggling-phishing-attacks-on-rise-detection-response/
    - https://www.cyfirma.com/outofband/html-smuggling-a-stealthier-approach-to-deliver-malware/
author: Micah Babinski
date: 2022/12/19
tags:
    - attack.s0650
    - attack.s0483
    - attack.initial_access
    - attack.defense_evasion
    - attack.t1566.001
    - attack.t1566
    - attack.t1027
    - attack.t1027.006
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4663
        ObjectType: 'File'
        AccessList: '%%4417'
        ObjectName|endswith:
            - '.html'
            - '.htm'
        ObjectName|re: '^[A-Z]:\\Users\\.*\\(Downloads|Desktop|Content\.Outlook|AppData\\Local\\Temp)\\.*$'
    condition: selection
falsepositives:
    - Plenty, this rule should probably only be used at the start of a chain rule for HTML smuggling or for demonstration purposes.
level: low