title: Web Browser Creates Archive or Disk Image File
id: 090cb067-ec91-4861-b080-89551401ea00
status: experimental
description: Detects browser applications creating zip, rar, 7z, iso, img, or vhd files, as occurs during an HTML smuggling attack where a browser decodes and executes malicious code within an HTML file. Commonly associated with QakBot and IcedID.
references:
    - https://blog.talosintelligence.com/html-smugglers-turn-to-svg-images/#:~:text=HTML%20smuggling%20is%20a%20technique,directly%20on%20the%20victim's%20device.
author: Micah Babinski
date: 2022/12/15
tags:
    - attack.s0650
    - attack.s0483
    - attack.defense_evasion
    - attack.t1027
    - attack.t1027.006
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4663
        ObjectType: 'File'
        AccessList: '%%4417'
        ObjectName|endswith:
            - '.zip'
            - '.rar'
            - '.7z'
            - '.iso'
            - '.img'
            - '.vhd'
        ProcessName|endswith: 
            - '\chrome.exe'
            - '\firefox.exe'
            - '\iexplore.exe'
            - '\msedge.exe'
            - '\MicrosoftEdgeCP.exe'
    condition: selection
falsepositives:
    - Unknown
level: medium