title: ISO, VHD, LNK, or IMG File Extracted from Zip
id: c0c2d715-9066-4d6c-80c8-7f3e74780b85
status: experimental
description: Detects extraction of ISO, VHD, LNK, or IMG files from zip files. Commonly associated with QakBot and IcedID.
references:
    - https://blog.talosintelligence.com/html-smugglers-turn-to-svg-images/#:~:text=HTML%20smuggling%20is%20a%20technique,directly%20on%20the%20victim's%20device.
author: Micah Babinski
date: 2022/12/15
tags:
    - attack.s0650
    - attack.s0483
    - attack.defense_evasion
    - attack.t1027
    - attack.t1027.006
    - attack.t1564
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4663
        ObjectType: 'File'
        AccessList: '%%4417'
        ObjectName|endswith:
            - '.iso'
            - '.img'
            - '.lnk'
            - '.vhd'
    condition: selection
falsepositives:
    - Unknown
level: medium