title: Suspicious User-Initiated Process Execution on External Drive
id: ff0b10c4-28c0-4663-a7e5-850c139101a8
status: experimental
description: Detects command/scripting interpreter-created processes executing on an external drive. This will detect common instances of malware using LNK files to obscure malicious commands for user execution. Commonly associated with QakBot and IcedID.
references:
    - https://blog.talosintelligence.com/html-smugglers-turn-to-svg-images/#:~:text=HTML%20smuggling%20is%20a%20technique,directly%20on%20the%20victim's%20device.
    - Research and analysis performed off of QakBot intelligence gathered at https://github.com/pr0xylife/Qakbot
author: Micah Babinski
date: 2022/12/19
tags:
    - attack.s0650
    - attack.s0483
    - attack.execution
    - attack.t1059
    - attack.t1204
    - attack.t1204.002
logsource:
    product: windows
    service: security
detection:
    selection_evt_type:
        EventID: 4688
    selection_proc_path:
        - ParentProcessName|startswith: '\Device\CdRom0'
        - ProcessName|startswith: '\Device\CdRom0'
    condition: all of selection*
falsepositives:
    - Unknown
level: high